import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from sklearn.metrics import confusion_matrix
import matplotlib

# 设置中文字体
plt.rcParams['font.sans-serif'] = ['SimHei']  # 使用黑体
plt.rcParams['axes.unicode_minus'] = False    # 正常显示负号

# 混淆矩阵数据
conf_matrix = np.array([
    [390, 0],   # TN, FP
    [2, 8]      # FN, TP
])

# conf_matrix = np.array(
#     [[115,385],
#     [ 52,448]]
# )


# 可视化
plt.figure(figsize=(6, 5))
sns.heatmap(conf_matrix, annot=True, fmt="d", cmap="Blues",
            xticklabels=["非鼾声", "鼾声"],
            yticklabels=["非鼾声", "鼾声"])
plt.ylabel("真实标签")
plt.xlabel("预测标签")
plt.tight_layout()
plt.savefig("m.pdf",format='pdf')
plt.show()



import matplotlib.pyplot as plt

# 训练与验证损失数据
train_loss = [0.6918755746812546, 0.6921038994478467, 0.6917472152662352, 0.6869204691456947,
              0.6807791194803952, 0.66989792046274,   0.6552306530509094, 0.6351573722948911,
              0.6005350648243319, 0.5545336665580712, 0.5004308533810651, 0.44925510129141377,
              0.42587631348378885, 0.40451967391232013, 0.38683691119931013, 0.3749053894935554,
              0.3841512944505141, 0.3708540125903467, 0.3807801411690106, 0.37438165886857383,
              0.36210040111869524, 0.38107543292391716, 0.37141138973058285, 0.36699813941723386,
              0.3672536792693141, 0.3610829056661607, 0.3474709748584003, 0.3470047937524909,
              0.3637307323128773, 0.35250845618268]
val_loss   = [0.6847328406292945, 0.6709405244328082, 0.674387214705348,  0.6732676367973909,
              0.6666444931179285, 0.6495690535521135, 0.6336425532354042, 0.5887700757011771,
              0.5417399745201692, 0.45954784692730755, 0.3622758568089921, 0.2830228609382175,
              0.22394722892931895,0.1836725044558989, 0.17512188163163955,0.16209432457981165,
              0.17240526315799798,0.1582068088428059, 0.16282378345204052,0.16293121883791173,
              0.15648611198412254,0.1686516955596744, 0.16824493987223832,0.19525417569093406,
              0.15745151984447148,0.1909200181307824, 0.17860694525916188,0.16487199954644893,
              0.18451263838869636,0.15528161309703137]

# 绘图
plt.figure(figsize=(8, 6), dpi=300)
plt.plot(train_loss, label='训练集损失', linestyle='-', marker='o')
plt.plot(val_loss, label='测试集损失', linestyle='--', marker='s')

# 标注
plt.xlabel('迭代轮数(Epoch)', fontsize=12)
plt.ylabel('损失值 (Loss)', fontsize=12)
plt.title('训练过程中的损失函数变化曲线', fontsize=14)
plt.legend(loc='upper right', fontsize=10)
plt.grid(True)
plt.tight_layout()

# 保存为高分辨率图片（可用于论文插图）
plt.savefig("mc.pdf",format='pdf')
plt.show()
